# DBeam_SetBeamAngle2

```pascal
PROCEDURE DBeam_SetBeamAngle2(angle : REAL);
```

```python
def vs.DBeam_SetBeamAngle2(angle):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|angle|REAL|   |

## Examples
```pascal
DBeam_SetBeamAngle2(1.0);
```
```python
import vs

angle = 45.0

vs.DBeam_SetBeamAngle2(angle)
```

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight